xlloss/OTA_RL78_R5F10BBG_Bootloader/generate/iodefine.h
#define TRDGRA1      (*(volatile __near unsigned short *)0x288)
#define TRDGRB1      (*(volatile __near unsigned short *)0x28A)
#define PER1         (*(volatile __near unsigned char  *)0x2C0)
#define PER1_bit     (*(volatile __near __bitf_T *)0x2C0)
#define TRJ0EN       (((volatile __near __bitf_T *)0x2C0)->no0)
#define DTCEN        (((volatile __near __bitf_T *)0x2C0)->no3)
#define TRD0EN       (((volatile __near __bitf_T *)0x2C0)->no4)
#define PER2         (*(volatile __near unsigned char  *)0x2C1)
#define PER2_bit     (*(volatile __near __bitf_T *)0x2C1)
#define CAN0EN       (((volatile __near __bitf_T *)0x2C1)->no0)
#define LIN0EN       (((volatile __near __bitf_T *)0x2C1)->no2)
#define CANCKSEL     (*(volatile __near unsigned char  *)0x2C2)
#define CANCKSEL_bit (*(volatile __near __bitf_T *)0x2C2)
#define CAN0MCKE     (((volatile __near __bitf_T *)0x2C2)->no0)
#define LINCKSEL     (*(volatile __near unsigned char  *)0x2C3)
#define LINCKSEL_bit (*(volatile __near __bitf_T *)0x2C3)
#define LIN0MCK      (((volatile __near __bitf_T *)0x2C3)->no0)
#define LIN0MCKE     (((volatile __near __bitf_T *)0x2C3)->no4)
#define CKSEL        (*(volatile __near unsigned char  *)0x2C4)
#define CKSEL_bit    (*(volatile __near __bitf_T *)0x2C4)
#define SELLOSC      (((volatile __near __bitf_T *)0x2C4)->no0)
#define TRD_CKSEL    (((volatile __near __bitf_T *)0x2C4)->no2)
#define PLLCTL       (*(volatile __near unsigned char  *)0x2C5)
#define PLLCTL_bit   (*(volatile __near __bitf_T *)0x2C5)
#define PLLON        (((volatile __near __bitf_T *)0x2C5)->no0)
#define PLLMUL       (((volatile __near __bitf_T *)0x2C5)->no1)
#define SELPLL       (((volatile __near __bitf_T *)0x2C5)->no2)
#define PLLDIV0      (((volatile __near __bitf_T *)0x2C5)->no4)
#define PLLDIV1      (((volatile __near __bitf_T *)0x2C5)->no5)
#define LCKSEL0      (((volatile __near __bitf_T *)0x2C5)->no6)
#define LCKSEL1      (((volatile __near __bitf_T *)0x2C5)->no7)
#define PLLSTS       (*(volatile __near unsigned char  *)0x2C6)
#define PLLSTS_bit   (*(volatile __near __bitf_T *)0x2C6)
#define SELPLLS      (((volatile __near __bitf_T *)0x2C6)->no3)
#define LOCK         (((volatile __near __bitf_T *)0x2C6)->no7)
#define MDIV         (*(volatile __near unsigned char  *)0x2C7)
#define RTCCL        (*(volatile __near unsigned char  *)0x2C8)
#define RTCCL_bit    (*(volatile __near __bitf_T *)0x2C8)
#define POCRES       (*(volatile __near unsigned char  *)0x2C9)
#define POCRES_bit   (*(volatile __near __bitf_T *)0x2C9)
#define POCRES0      (((volatile __near __bitf_T *)0x2C9)->no0)
#define CLKRF        (((volatile __near __bitf_T *)0x2C9)->no4)
#define HDTCCR0      (*(volatile __near unsigned char  *)0x2D0)
#define HDTCCR0_bit  (*(volatile __near __bitf_T *)0x2D0)
#define HMODE0       (((volatile __near __bitf_T *)0x2D0)->no0)
#define HRPTSEL0     (((volatile __near __bitf_T *)0x2D0)->no1)
#define HSAMOD0      (((volatile __near __bitf_T *)0x2D0)->no2)
#define HDAMOD0      (((volatile __near __bitf_T *)0x2D0)->no3)
#define HCHNE0       (((volatile __near __bitf_T *)0x2D0)->no4)
#define HRPTINT0     (((volatile __near __bitf_T *)0x2D0)->no5)
#define HSZ0         (((volatile __near __bitf_T *)0x2D0)->no6)
#define HDTCCT0      (*(volatile __near unsigned char  *)0x2D2)
#define HDTCCT0_bit  (*(volatile __near __bitf_T *)0x2D2)
#define HDTRLD0      (*(volatile __near unsigned char  *)0x2D3)
#define HDTRLD0_bit  (*(volatile __near __bitf_T *)0x2D3)
#define HDTSAR0      (*(volatile __near unsigned short *)0x2D4)
#define HDTDAR0      (*(volatile __near unsigned short *)0x2D6)
#define HDTCCR1      (*(volatile __near unsigned char  *)0x2D8)
#define HDTCCR1_bit  (*(volatile __near __bitf_T *)0x2D8)
#define HMODE1       (((volatile __near __bitf_T *)0x2D8)->no0)
#define HRPTSEL1     (((volatile __near __bitf_T *)0x2D8)->no1)
#define HSAMOD1      (((volatile __near __bitf_T *)0x2D8)->no2)
#define HDAMOD1      (((volatile __near __bitf_T *)0x2D8)->no3)
#define HCHNE1       (((volatile __near __bitf_T *)0x2D8)->no4)
#define HRPTINT1     (((volatile __near __bitf_T *)0x2D8)->no5)
#define HSZ1         (((volatile __near __bitf_T *)0x2D8)->no6)
#define HDTCCT1      (*(volatile __near unsigned char  *)0x2DA)
#define HDTCCT1_bit  (*(volatile __near __bitf_T *)0x2DA)
#define HDTRLD1      (*(volatile __near unsigned char  *)0x2DB)
#define HDTRLD1_bit  (*(volatile __near __bitf_T *)0x2DB)
#define HDTSAR1      (*(volatile __near unsigned short *)0x2DC)
#define HDTDAR1      (*(volatile __near unsigned short *)0x2DE)
#define DTCBAR       (*(volatile __near unsigned char  *)0x2E0)
#define SELHS0       (*(volatile __near unsigned char  *)0x2E1)
#define SELHS0_bit   (*(volatile __near __bitf_T *)0x2E1)
#define SELHS1       (*(volatile __near unsigned char  *)0x2E2)
#define SELHS1_bit   (*(volatile __near __bitf_T *)0x2E2)
#define DTCEN0       (*(volatile __near unsigned char  *)0x2E8)
#define DTCEN0_bit   (*(volatile __near __bitf_T *)0x2E8)
#define DTCEN01      (((volatile __near __bitf_T *)0x2E8)->no1)
#define DTCEN02      (((volatile __near __bitf_T *)0x2E8)->no2)
#define DTCEN03      (((volatile __near __bitf_T *)0x2E8)->no3)
#define DTCEN04      (((volatile __near __bitf_T *)0x2E8)->no4)
#define DTCEN05      (((volatile __near __bitf_T *)0x2E8)->no5)
#define DTCEN06      (((volatile __near __bitf_T *)0x2E8)->no6)
#define DTCEN1       (*(volatile __near unsigned char  *)0x2E9)
#define DTCEN1_bit   (*(volatile __near __bitf_T *)0x2E9)
#define DTCEN10      (((volatile __near __bitf_T *)0x2E9)->no0)
#define DTCEN11      (((volatile __near __bitf_T *)0x2E9)->no1)
#define DTCEN12      (((volatile __near __bitf_T *)0x2E9)->no2)
#define DTCEN13      (((volatile __near __bitf_T *)0x2E9)->no3)
#define DTCEN14      (((volatile __near __bitf_T *)0x2E9)->no4)
#define DTCEN15      (((volatile __near __bitf_T *)0x2E9)->no5)
#define DTCEN16      (((volatile __near __bitf_T *)0x2E9)->no6)
#define DTCEN17      (((volatile __near __bitf_T *)0x2E9)->no7)
#define DTCEN2       (*(volatile __near unsigned char  *)0x2EA)
#define DTCEN2_bit   (*(volatile __near __bitf_T *)0x2EA)
#define DTCEN20      (((volatile __near __bitf_T *)0x2EA)->no0)
#define DTCEN21      (((volatile __near __bitf_T *)0x2EA)->no1)
#define DTCEN22      (((volatile __near __bitf_T *)0x2EA)->no2)
#define DTCEN23      (((volatile __near __bitf_T *)0x2EA)->no3)
#define DTCEN24      (((volatile __near __bitf_T *)0x2EA)->no4)
#define DTCEN25      (((volatile __near __bitf_T *)0x2EA)->no5)
#define DTCEN27      (((volatile __near __bitf_T *)0x2EA)->no7)
#define DTCEN3       (*(volatile __near unsigned char  *)0x2EB)
#define DTCEN3_bit   (*(volatile __near __bitf_T *)0x2EB)
#define DTCEN30      (((volatile __near __bitf_T *)0x2EB)->no0)
#define DTCEN31      (((volatile __near __bitf_T *)0x2EB)->no1)
#define DTCEN32      (((volatile __near __bitf_T *)0x2EB)->no2)
#define DTCEN33      (((volatile __near __bitf_T *)0x2EB)->no3)
#define DTCEN34      (((volatile __near __bitf_T *)0x2EB)->no4)
#define DTCEN35      (((volatile __near __bitf_T *)0x2EB)->no5)
#define DTCEN36      (((volatile __near __bitf_T *)0x2EB)->no6)
#define DTCEN37      (((volatile __near __bitf_T *)0x2EB)->no7)
#define DTCEN4       (*(volatile __near unsigned char  *)0x2EC)
#define DTCEN4_bit   (*(volatile __near __bitf_T *)0x2EC)
#define DTCEN40      (((volatile __near __bitf_T *)0x2EC)->no0)
#define DTCEN41      (((volatile __near __bitf_T *)0x2EC)->no1)
#define DTCEN42      (((volatile __near __bitf_T *)0x2EC)->no2)
#define DTCEN43      (((volatile __near __bitf_T *)0x2EC)->no3)
#define DTCEN45      (((volatile __near __bitf_T *)0x2EC)->no5)
#define DTCEN46      (((volatile __near __bitf_T *)0x2EC)->no6)
#define DTCEN47      (((volatile __near __bitf_T *)0x2EC)->no7)
#define CRC0CTL      (*(volatile __near unsigned char  *)0x2F0)
#define CRC0CTL_bit  (*(volatile __near __bitf_T *)0x2F0)
#define CRC0EN       (((volatile __near __bitf_T *)0x2F0)->no7)
#define PGCRCL       (*(volatile __near unsigned short *)0x2F2)
#define CRCMD        (*(volatile __near unsigned char  *)0x2F9)
#define CRCD         (*(volatile __near unsigned short *)0x2FA)
#define C0CFGL       (*(volatile __near unsigned short *)0x300)
#define C0CFGLL      (*(volatile __near unsigned char  *)0x300)
#define C0CFGLH      (*(volatile __near unsigned char  *)0x301)
#define C0CFGH       (*(volatile __near unsigned short *)0x302)
#define C0CFGHL      (*(volatile __near unsigned char  *)0x302)
#define C0CFGHH      (*(volatile __near unsigned char  *)0x303)
#define C0CTRL       (*(volatile __near unsigned short *)0x304)
#define C0CTRLL      (*(volatile __near unsigned char  *)0x304)
#define C0CTRLH      (*(volatile __near unsigned char  *)0x305)
#define C0CTRH       (*(volatile __near unsigned short *)0x306)
#define C0CTRHL      (*(volatile __near unsigned char  *)0x306)
#define C0CTRHH      (*(volatile __near unsigned char  *)0x307)
#define C0STSL       (*(volatile __near unsigned short *)0x308)
#define C0STSLL      (*(volatile __near unsigned char  *)0x308)
#define C0STSLH      (*(volatile __near unsigned char  *)0x309)
#define C0STSH       (*(volatile __near unsigned short *)0x30A)
#define C0STSHL      (*(volatile __near unsigned char  *)0x30A)
#define C0STSHH      (*(volatile __near unsigned char  *)0x30B)
#define C0ERFLL      (*(volatile __near unsigned short *)0x30C)
#define C0ERFLLL     (*(volatile __near unsigned char  *)0x30C)
#define C0ERFLLH     (*(volatile __near unsigned char  *)0x30D)
#define C0ERFLH      (*(volatile __near unsigned short *)0x30E)
#define C0ERFLHL     (*(volatile __near unsigned char  *)0x30E)
#define C0ERFLHH     (*(volatile __near unsigned char  *)0x30F)
#define GCFGL        (*(volatile __near unsigned short *)0x322)
#define GCFGLL       (*(volatile __near unsigned char  *)0x322)
#define GCFGLH       (*(volatile __near unsigned char  *)0x323)
#define GCFGH        (*(volatile __near unsigned short *)0x324)
#define GCFGHL       (*(volatile __near unsigned char  *)0x324)
#define GCFGHH       (*(volatile __near unsigned char  *)0x325)
#define GCTRL        (*(volatile __near unsigned short *)0x326)
#define GCTRLL       (*(volatile __near unsigned char  *)0x326)
#define GCTRLH       (*(volatile __near unsigned char  *)0x327)
#define GCTRH        (*(volatile __near unsigned short *)0x328)
#define GCTRHL       (*(volatile __near unsigned char  *)0x328)
#define GCTRHH       (*(volatile __near unsigned char  *)0x329)
#define GSTS         (*(volatile __near unsigned short *)0x32A)
#define GSTSL        (*(volatile __near unsigned char  *)0x32A)
#define GSTSH        (*(volatile __near unsigned char  *)0x32B)
#define GERFLL       (*(volatile __near unsigned char  *)0x32C)
#define GTSC         (*(volatile __near unsigned short *)0x32E)
#define GAFLCFG      (*(volatile __near unsigned short *)0x330)
#define GAFLCFGL     (*(volatile __near unsigned char  *)0x330)
#define GAFLCFGH     (*(volatile __near unsigned char  *)0x331)
#define RMNB         (*(volatile __near unsigned short *)0x332)
#define RMNBL        (*(volatile __near unsigned char  *)0x332)
#define RMND0        (*(volatile __near unsigned short *)0x334)
#define RMND0L       (*(volatile __near unsigned char  *)0x334)
#define RMND0H       (*(volatile __near unsigned char  *)0x335)
#define RFCC0        (*(volatile __near unsigned short *)0x338)
#define RFCC0L       (*(volatile __near unsigned char  *)0x338)
#define RFCC0H       (*(volatile __near unsigned char  *)0x339)
#define RFCC1        (*(volatile __near unsigned short *)0x33A)
#define RFCC1L       (*(volatile __near unsigned char  *)0x33A)
#define RFCC1H       (*(volatile __near unsigned char  *)0x33B)
#define RFSTS0       (*(volatile __near unsigned short *)0x340)
#define RFSTS0L      (*(volatile __near unsigned char  *)0x340)
#define RFSTS0H      (*(volatile __near unsigned char  *)0x341)
#define RFSTS1       (*(volatile __near unsigned short *)0x342)
#define RFSTS1L      (*(volatile __near unsigned char  *)0x342)
#define RFSTS1H      (*(volatile __near unsigned char  *)0x343)
#define RFPCTR0      (*(volatile __near unsigned short *)0x348)
#define RFPCTR0L     (*(volatile __near unsigned char  *)0x348)
#define RFPCTR0H     (*(volatile __near unsigned char  *)0x349)
#define RFPCTR1      (*(volatile __near unsigned short *)0x34A)
#define RFPCTR1L     (*(volatile __near unsigned char  *)0x34A)
#define RFPCTR1H     (*(volatile __near unsigned char  *)0x34B)
#define CFCCL0       (*(volatile __near unsigned short *)0x350)
#define CFCCL0L      (*(volatile __near unsigned char  *)0x350)
#define CFCCL0H      (*(volatile __near unsigned char  *)0x351)
#define CFCCH0       (*(volatile __near unsigned short *)0x352)
#define CFCCH0L      (*(volatile __near unsigned char  *)0x352)
#define CFCCH0H      (*(volatile __near unsigned char  *)0x353)
#define CFSTS0       (*(volatile __near unsigned short *)0x358)
#define CFSTS0L      (*(volatile __near unsigned char  *)0x358)
#define CFSTS0H      (*(volatile __near unsigned char  *)0x359)
#define CFPCTR0      (*(volatile __near unsigned short *)0x35C)
#define CFPCTR0L     (*(volatile __near unsigned char  *)0x35C)
#define RFMSTS       (*(volatile __near unsigned char  *)0x360)
#define CFMSTS       (*(volatile __near unsigned char  *)0x361)
#define RFISTS       (*(volatile __near unsigned char  *)0x362)
#define CFISTS       (*(volatile __near unsigned char  *)0x363)
#define TMC0         (*(volatile __near unsigned char  *)0x364)
#define TMC1         (*(volatile __near unsigned char  *)0x365)
#define TMC2         (*(volatile __near unsigned char  *)0x366)
#define TMC3         (*(volatile __near unsigned char  *)0x367)
#define TMSTS0       (*(volatile __near unsigned char  *)0x36C)
#define TMSTS1       (*(volatile __near unsigned char  *)0x36D)
#define TMSTS2       (*(volatile __near unsigned char  *)0x36E)
#define TMSTS3       (*(volatile __near unsigned char  *)0x36F)
#define TMTRSTS      (*(volatile __near unsigned short *)0x374)
#define TMTRSTSL     (*(volatile __near unsigned char  *)0x374)
#define TMTRSTSH     (*(volatile __near unsigned char  *)0x375)
#define TMTCSTS      (*(volatile __near unsigned short *)0x376)
#define TMTCSTSL     (*(volatile __near unsigned char  *)0x376)
#define TMTCSTSH     (*(volatile __near unsigned char  *)0x377)
#define TMTASTS      (*(volatile __near unsigned short *)0x378)
#define TMTASTSL     (*(volatile __near unsigned char  *)0x378)
#define TMTASTSH     (*(volatile __near unsigned char  *)0x379)
#define TMIEC        (*(volatile __near unsigned short *)0x37A)
#define TMIECL       (*(volatile __near unsigned char  *)0x37A)
#define TMIECH       (*(volatile __near unsigned char  *)0x37B)
#define THLCC0       (*(volatile __near unsigned short *)0x37C)
#define THLCC0L      (*(volatile __near unsigned char  *)0x37C)
#define THLCC0H      (*(volatile __near unsigned char  *)0x37D)
#define THLSTS0      (*(volatile __near unsigned short *)0x380)
#define THLSTS0L     (*(volatile __near unsigned char  *)0x380)
#define THLSTS0H     (*(volatile __near unsigned char  *)0x381)
#define THLPCTR0     (*(volatile __near unsigned short *)0x384)
#define THLPCTR0L    (*(volatile __near unsigned char  *)0x384)
#define THLPCTR0H    (*(volatile __near unsigned char  *)0x385)
#define GTINTSTS     (*(volatile __near unsigned short *)0x388)
#define GTINTSTSL    (*(volatile __near unsigned char  *)0x388)
#define GTINTSTSH    (*(volatile __near unsigned char  *)0x389)
#define GRWCR        (*(volatile __near unsigned short *)0x38A)
#define GRWCRL       (*(volatile __near unsigned char  *)0x38A)
#define GRWCRH       (*(volatile __near unsigned char  *)0x38B)
#define GTSTCFG      (*(volatile __near unsigned short *)0x38C)
#define GTSTCFGL     (*(volatile __near unsigned char  *)0x38C)
#define GTSTCFGH     (*(volatile __near unsigned char  *)0x38D)
#define GTSTCTRL     (*(volatile __near unsigned char  *)0x38E)
#define GLOCKK       (*(volatile __near unsigned short *)0x394)
#define GAFLIDL0     (*(volatile __near unsigned short *)0x3A0)
#define RMIDL0       (*(volatile __near unsigned short *)0x3A0)
#define GAFLIDL0L    (*(volatile __near unsigned char  *)0x3A0)
#define RMIDL0L      (*(volatile __near unsigned char  *)0x3A0)
#define GAFLIDL0H    (*(volatile __near unsigned char  *)0x3A1)
#define RMIDL0H      (*(volatile __near unsigned char  *)0x3A1)
#define GAFLIDH0     (*(volatile __near unsigned short *)0x3A2)
#define RMIDH0       (*(volatile __near unsigned short *)0x3A2)
#define GAFLIDH0L    (*(volatile __near unsigned char  *)0x3A2)
#define RMIDH0L      (*(volatile __near unsigned char  *)0x3A2)
#define GAFLIDH0H    (*(volatile __near unsigned char  *)0x3A3)
#define RMIDH0H      (*(volatile __near unsigned char  *)0x3A3)
#define GAFLML0      (*(volatile __near unsigned short *)0x3A4)
#define RMTS0        (*(volatile __near unsigned short *)0x3A4)
#define GAFLML0L     (*(volatile __near unsigned char  *)0x3A4)
#define RMTS0L       (*(volatile __near unsigned char  *)0x3A4)
#define GAFLML0H     (*(volatile __near unsigned char  *)0x3A5)
#define RMTS0H       (*(volatile __near unsigned char  *)0x3A5)
#define GAFLMH0      (*(volatile __near unsigned short *)0x3A6)
#define RMPTR0       (*(volatile __near unsigned short *)0x3A6)
#define GAFLMH0L     (*(volatile __near unsigned char  *)0x3A6)
#define RMPTR0L      (*(volatile __near unsigned char  *)0x3A6)
#define GAFLMH0H     (*(volatile __near unsigned char  *)0x3A7)
#define RMPTR0H      (*(volatile __near unsigned char  *)0x3A7)
#define GAFLPL0      (*(volatile __near unsigned short *)0x3A8)
#define RMDF00       (*(volatile __near unsigned short *)0x3A8)
#define GAFLPL0L     (*(volatile __near unsigned char  *)0x3A8)
#define RMDF00L      (*(volatile __near unsigned char  *)0x3A8)
#define GAFLPL0H     (*(volatile __near unsigned char  *)0x3A9)
#define RMDF00H      (*(volatile __near unsigned char  *)0x3A9)
#define GAFLPH0      (*(volatile __near unsigned short *)0x3AA)
#define RMDF10       (*(volatile __near unsigned short *)0x3AA)
#define GAFLPH0L     (*(volatile __near unsigned char  *)0x3AA)
#define RMDF10L      (*(volatile __near unsigned char  *)0x3AA)
#define GAFLPH0H     (*(volatile __near unsigned char  *)0x3AB)
#define RMDF10H      (*(volatile __near unsigned char  *)0x3AB)
#define GAFLIDL1     (*(volatile __near unsigned short *)0x3AC)
#define RMDF20       (*(volatile __near unsigned short *)0x3AC)
#define GAFLIDL1L    (*(volatile __near unsigned char  *)0x3AC)
#define RMDF20L      (*(volatile __near unsigned char  *)0x3AC)
#define GAFLIDL1H    (*(volatile __near unsigned char  *)0x3AD)
#define RMDF20H      (*(volatile __near unsigned char  *)0x3AD)
#define GAFLIDH1     (*(volatile __near unsigned short *)0x3AE)
#define RMDF30       (*(volatile __near unsigned short *)0x3AE)
#define GAFLIDH1L    (*(volatile __near unsigned char  *)0x3AE)
#define RMDF30L      (*(volatile __near unsigned char  *)0x3AE)
#define GAFLIDH1H    (*(volatile __near unsigned char  *)0x3AF)
#define RMDF30H      (*(volatile __near unsigned char  *)0x3AF)
#define GAFLML1      (*(volatile __near unsigned short *)0x3B0)
#define RMIDL1       (*(volatile __near unsigned short *)0x3B0)
#define GAFLML1L     (*(volatile __near unsigned char  *)0x3B0)
#define RMIDL1L      (*(volatile __near unsigned char  *)0x3B0)
#define GAFLML1H     (*(volatile __near unsigned char  *)0x3B1)
#define RMIDL1H      (*(volatile __near unsigned char  *)0x3B1)
#define GAFLMH1      (*(volatile __near unsigned short *)0x3B2)
#define RMIDH1       (*(volatile __near unsigned short *)0x3B2)
#define GAFLMH1L     (*(volatile __near unsigned char  *)0x3B2)
#define RMIDH1L      (*(volatile __near unsigned char  *)0x3B2)
#define GAFLMH1H     (*(volatile __near unsigned char  *)0x3B3)
#define RMIDH1H      (*(volatile __near unsigned char  *)0x3B3)
#define GAFLPL1      (*(volatile __near unsigned short *)0x3B4)
#define RMTS1        (*(volatile __near unsigned short *)0x3B4)
#define GAFLPL1L     (*(volatile __near unsigned char  *)0x3B4)
#define RMTS1L       (*(volatile __near unsigned char  *)0x3B4)
#define GAFLPL1H     (*(volatile __near unsigned char  *)0x3B5)
#define RMTS1H       (*(volatile __near unsigned char  *)0x3B5)
#define GAFLPH1      (*(volatile __near unsigned short *)0x3B6)
#define RMPTR1       (*(volatile __near unsigned short *)0x3B6)
#define GAFLPH1L     (*(volatile __near unsigned char  *)0x3B6)
#define RMPTR1L      (*(volatile __near unsigned char  *)0x3B6)
#define GAFLPH1H     (*(volatile __near unsigned char  *)0x3B7)
#define RMPTR1H      (*(volatile __near unsigned char  *)0x3B7)
#define GAFLIDL2     (*(volatile __near unsigned short *)0x3B8)
#define RMDF01       (*(volatile __near unsigned short *)0x3B8)
#define GAFLIDL2L    (*(volatile __near unsigned char  *)0x3B8)
#define RMDF01L      (*(volatile __near unsigned char  *)0x3B8)
#define GAFLIDL2H    (*(volatile __near unsigned char  *)0x3B9)
#define RMDF01H      (*(volatile __near unsigned char  *)0x3B9)
#define GAFLIDH2     (*(volatile __near unsigned short *)0x3BA)
#define RMDF11       (*(volatile __near unsigned short *)0x3BA)
#define GAFLIDH2L    (*(volatile __near unsigned char  *)0x3BA)
#define RMDF11L      (*(volatile __near unsigned char  *)0x3BA)
#define GAFLIDH2H    (*(volatile __near unsigned char  *)0x3BB)
#define RMDF11H      (*(volatile __near unsigned char  *)0x3BB)
#define GAFLML2      (*(volatile __near unsigned short *)0x3BC)
#define RMDF21       (*(volatile __near unsigned short *)0x3BC)
#define GAFLML2L     (*(volatile __near unsigned char  *)0x3BC)
#define RMDF21L      (*(volatile __near unsigned char  *)0x3BC)
#define GAFLML2H     (*(volatile __near unsigned char  *)0x3BD)
#define RMDF21H      (*(volatile __near unsigned char  *)0x3BD)
#define GAFLMH2      (*(volatile __near unsigned short *)0x3BE)
#define RMDF31       (*(volatile __near unsigned short *)0x3BE)
#define GAFLMH2L     (*(volatile __near unsigned char  *)0x3BE)
#define RMDF31L      (*(volatile __near unsigned char  *)0x3BE)
#define GAFLMH2H     (*(volatile __near unsigned char  *)0x3BF)
#define RMDF31H      (*(volatile __near unsigned char  *)0x3BF)
#define GAFLPL2      (*(volatile __near unsigned short *)0x3C0)
#define RMIDL2       (*(volatile __near unsigned short *)0x3C0)
#define GAFLPL2L     (*(volatile __near unsigned char  *)0x3C0)
#define RMIDL2L      (*(volatile __near unsigned char  *)0x3C0)
#define GAFLPL2H     (*(volatile __near unsigned char  *)0x3C1)
#define RMIDL2H      (*(volatile __near unsigned char  *)0x3C1)
#define GAFLPH2      (*(volatile __near unsigned short *)0x3C2)
#define RMIDH2       (*(volatile __near unsigned short *)0x3C2)
#define GAFLPH2L     (*(volatile __near unsigned char  *)0x3C2)
#define RMIDH2L      (*(volatile __near unsigned char  *)0x3C2)
#define GAFLPH2H     (*(volatile __near unsigned char  *)0x3C3)
#define RMIDH2H      (*(volatile __near unsigned char  *)0x3C3)
#define GAFLIDL3     (*(volatile __near unsigned short *)0x3C4)
#define RMTS2        (*(volatile __near unsigned short *)0x3C4)
#define GAFLIDL3L    (*(volatile __near unsigned char  *)0x3C4)
#define RMTS2L       (*(volatile __near unsigned char  *)0x3C4)
#define GAFLIDL3H    (*(volatile __near unsigned char  *)0x3C5)
#define RMTS2H       (*(volatile __near unsigned char  *)0x3C5)
#define GAFLIDH3     (*(volatile __near unsigned short *)0x3C6)
#define RMPTR2       (*(volatile __near unsigned short *)0x3C6)
#define GAFLIDH3L    (*(volatile __near unsigned char  *)0x3C6)
#define RMPTR2L      (*(volatile __near unsigned char  *)0x3C6)
#define GAFLIDH3H    (*(volatile __near unsigned char  *)0x3C7)
#define RMPTR2H      (*(volatile __near unsigned char  *)0x3C7)
#define GAFLML3      (*(volatile __near unsigned short *)0x3C8)
#define RMDF02       (*(volatile __near unsigned short *)0x3C8)
#define GAFLML3L     (*(volatile __near unsigned char  *)0x3C8)
#define RMDF02L      (*(volatile __near unsigned char  *)0x3C8)
#define GAFLML3H     (*(volatile __near unsigned char  *)0x3C9)
#define RMDF02H      (*(volatile __near unsigned char  *)0x3C9)
