xlloss/OTA_RL78_R5F10BBG_Bootloader/generate/iodefine.h
#define TMPR000      (((volatile __near __bitf_T *)0xFFEA)->no4)
#define TMPR001      (((volatile __near __bitf_T *)0xFFEA)->no5)
#define TMPR002      (((volatile __near __bitf_T *)0xFFEA)->no6)
#define TMPR003      (((volatile __near __bitf_T *)0xFFEA)->no7)
#define ADPR0        (((volatile __near __bitf_T *)0xFFEB)->no0)
#define TMPR011H     (((volatile __near __bitf_T *)0xFFEB)->no1)
#define TMPR013H     (((volatile __near __bitf_T *)0xFFEB)->no2)
#define TMPR001H     (((volatile __near __bitf_T *)0xFFEB)->no3)
#define TMPR003H     (((volatile __near __bitf_T *)0xFFEB)->no4)
#define CSIPR010     (((volatile __near __bitf_T *)0xFFEB)->no5)
#define IICPR010     (((volatile __near __bitf_T *)0xFFEB)->no5)
#define STPR01       (((volatile __near __bitf_T *)0xFFEB)->no5)
#define SRPR01       (((volatile __near __bitf_T *)0xFFEB)->no6)
#define TMPR004      (((volatile __near __bitf_T *)0xFFEB)->no7)
#define PR10         (*(volatile __near unsigned short *)0xFFEC)
#define PR10L        (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit    (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H        (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit    (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1      (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1       (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10        (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11        (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12        (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13        (((volatile __near __bitf_T *)0xFFEC)->no5)
#define PPR14        (((volatile __near __bitf_T *)0xFFEC)->no6)
#define SPMPR1       (((volatile __near __bitf_T *)0xFFEC)->no6)
#define PPR15        (((volatile __near __bitf_T *)0xFFEC)->no7)
#define CLMPR1       (((volatile __near __bitf_T *)0xFFED)->no0)
#define CSIPR100     (((volatile __near __bitf_T *)0xFFED)->no1)
#define IICPR100     (((volatile __near __bitf_T *)0xFFED)->no1)
#define STPR10       (((volatile __near __bitf_T *)0xFFED)->no1)
#define CSIPR101     (((volatile __near __bitf_T *)0xFFED)->no2)
#define IICPR101     (((volatile __near __bitf_T *)0xFFED)->no2)
#define SRPR10       (((volatile __near __bitf_T *)0xFFED)->no2)
#define TRDPR10      (((volatile __near __bitf_T *)0xFFED)->no3)
#define TRDPR11      (((volatile __near __bitf_T *)0xFFED)->no4)
#define TRJPR10      (((volatile __near __bitf_T *)0xFFED)->no5)
#define RAMPR1       (((volatile __near __bitf_T *)0xFFED)->no6)
#define LIN0TRMPR1   (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11         (*(volatile __near unsigned short *)0xFFEE)
#define PR11L        (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit    (*(volatile __near __bitf_T *)0xFFEE)
#define PR11H        (*(volatile __near unsigned char  *)0xFFEF)
#define PR11H_bit    (*(volatile __near __bitf_T *)0xFFEF)
#define LIN0RVCPR1   (((volatile __near __bitf_T *)0xFFEE)->no0)
#define LIN0PR1      (((volatile __near __bitf_T *)0xFFEE)->no1)
#define LIN0STAPR1   (((volatile __near __bitf_T *)0xFFEE)->no1)
#define IICAPR10     (((volatile __near __bitf_T *)0xFFEE)->no2)
#define RTCPR1       (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR100      (((volatile __near __bitf_T *)0xFFEE)->no4)
#define TMPR101      (((volatile __near __bitf_T *)0xFFEE)->no5)
#define TMPR102      (((volatile __near __bitf_T *)0xFFEE)->no6)
#define TMPR103      (((volatile __near __bitf_T *)0xFFEE)->no7)
#define ADPR1        (((volatile __near __bitf_T *)0xFFEF)->no0)
#define TMPR111H     (((volatile __near __bitf_T *)0xFFEF)->no1)
#define TMPR113H     (((volatile __near __bitf_T *)0xFFEF)->no2)
#define TMPR101H     (((volatile __near __bitf_T *)0xFFEF)->no3)
#define TMPR103H     (((volatile __near __bitf_T *)0xFFEF)->no4)
#define CSIPR110     (((volatile __near __bitf_T *)0xFFEF)->no5)
#define IICPR110     (((volatile __near __bitf_T *)0xFFEF)->no5)
#define STPR11       (((volatile __near __bitf_T *)0xFFEF)->no5)
#define SRPR11       (((volatile __near __bitf_T *)0xFFEF)->no6)
#define TMPR104      (((volatile __near __bitf_T *)0xFFEF)->no7)
#define MACRL        (*(volatile __near unsigned short *)0xFFF0)
#define MACRH        (*(volatile __near unsigned short *)0xFFF2)
#define PMC          (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit      (*(volatile __near __bitf_T *)0xFFFE)
#define MAA          (((volatile __near __bitf_T *)0xFFFE)->no0)


#define INTSRO                          0x0004
#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTP4                           0x0010
#define INTSPM                          0x0010
#define INTP5                           0x0012
#define INTCLM                          0x0014
#define INTCSI00                        0x0016
#define INTIIC00                        0x0016
#define INTST0                          0x0016
#define INTCSI01                        0x0018
#define INTIIC01                        0x0018
#define INTSR0                          0x0018
#define INTTRD0                         0x001A
#define INTTRD1                         0x001C
#define INTTRJ0                         0x001E
#define INTRAM                          0x0020
#define INTLIN0TRM                      0x0022
#define INTLIN0RVC                      0x0024
#define INTLIN0                         0x0026
#define INTLIN0STA                      0x0026
#define INTIICA0                        0x0028
#define INTRTC                          0x002A
#define INTTM00                         0x002C
#define INTTM01                         0x002E
#define INTTM02                         0x0030
#define INTTM03                         0x0032
#define INTAD                           0x0034
#define INTTM11H                        0x0036
#define INTTM13H                        0x0038
#define INTTM01H                        0x003A
#define INTTM03H                        0x003C
#define INTCSI10                        0x003E
#define INTIIC10                        0x003E
#define INTST1                          0x003E
#define INTSR1                          0x0040
#define INTTM04                         0x0042
#define INTTM05                         0x0044
#define INTTM06                         0x0046
#define INTTM07                         0x0048
#define INTLIN0WUP                      0x004A
#define INTKR                           0x004C
#define INTCAN0ERR                      0x004E
#define INTCAN0WUP                      0x0050
#define INTCAN0CFR                      0x0052
#define INTCAN0TRM                      0x0054
#define INTCANGRFR                      0x0056
#define INTCANGERR                      0x0058
#define INTTM10                         0x005A
#define INTTM11                         0x005C
#define INTTM12                         0x005E
#define INTTM13                         0x0060
#define INTFL                           0x0062

#endif
